# Пользователь Василий очень часто злоупотребляет восклицательными знаками!
# Напишите программу, которая будет заменять восклицательные знаки на точки.
# Пример строки: «Вася самый умный! Вася лучше всех! И ждет его успех! Вот так!»

text = "foobar!!!"

text = text.replace('!','.')

print(text)

# Важно! Ваше решение должно работать не только с данной строкой, но и с любой другой.
# Честно говоря, не понял, как может быть иначе...
